{
    "0": "Simplify expressions by eliminating parentheses using distribution rules, including handling nested and complex cases.",
    "1": "Remove constant terms by isolating variables on one side of the equation for simplification or solving.",
    "2": "Isolate the variable in positive form by rearranging and simplifying the equation.",
    "3": "Remove coefficients from variables by dividing or multiplying, simplifying the equation to a simpler form.",
    "4": "Eliminate negative coefficients by converting them into positive coefficients using standard algebraic transformations.",
    "5": "Simplify equations with negative coefficients while isolating the variable.",
    "6": "Eliminate positive coefficients by dividing or applying standard algebraic rules.",
    "7": "Apply addition or subtraction to isolate variables, move constants, and simplify equations.",
    "8": "Simplify equations using multiplication or division to remove coefficients or denominators.",
    "9": "Combine like terms with coefficients to simplify expressions.",
    "10": "Combine like terms without coefficients to simplify and rearrange expressions.",
    "11": "Isolate the variable when it is in negative form by rearranging and simplifying the equation.",
    "12": "Eliminate parentheses by distributing and simplifying expressions.",
    "13": "Simplify fractions by clearing the numerator or denominator.",
    "14": "Combine like terms without coefficients to restructure the equation.",
    "15": "Select and combine terms to simplify or restructure the expression.",
    "16": "Apply the distributive property to expand parentheses and simplify expressions.",
    "17": "Simplify equations with variables in the denominator by clearing the fraction and reorganizing the equation.",
    "18": "Extract common factors to consolidate variables and simplify expressions.",
    "19": "Determine if an equation is solved or has specific outcomes, such as no solution, domain exceptions, or infinite solutions.",
    "20": "Factor expressions into products to identify roots or simplify calculations.",
    "21": "Eliminate parentheses by multiplying or dividing terms to simplify variable expressions.",
    "22": "Make variables positive by adjusting signs and simplifying the equation through algebraic transformations.",
    "23": "Use reciprocal multiplication to simplify equations and expressions.",
    "24": "Define variables and establish their relationships to the problem context.",
    "25": "Identify and apply appropriate units to expressions and equations.",
    "26": "Use simple numbers for calculations to ensure clarity and ease of understanding.",
    "27": "Write linear expressions with a positive slope to describe relationships between variables.",
    "28": "Use large numbers in calculations to reflect practical applications.",
    "29": "Input given conditions or initial values to set up models or equations.",
    "30": "Solve for the unknown variable X in scenarios with a positive slope.",
    "31": "Use small numbers for calculations to enhance clarity and verification.",
    "32": "Convert units into standard forms for consistency and accuracy.",
    "33": "Use complex numbers in calculations to address advanced or challenging problems.",
    "34": "Solve for the unknown variable Y in any given form of an equation.",
    "35": "Perform unit conversion using multipliers to maintain proportionality.",
    "36": "Solve for the unknown variable Y using simple and direct methods.",
    "37": "Solve for the unknown variable X using straightforward and direct steps.",
    "38": "Solve for Y in cases involving a positive slope.",
    "39": "Combine variables in any form by reorganizing them to one side of the equation.",
    "40": "Label axes to clearly represent the meaning of variables.",
    "41": "Adjust axis bounds to fit the required graph or data representation.",
    "42": "Change axis intervals to improve data readability and precision.",
    "43": "Label the point of intersection to indicate solutions or key relationships.",
    "44": "Write linear expressions with a negative slope to describe relationships between variables.",
    "45": "Solve for Y in cases involving a negative slope.",
    "46": "Solve for X in cases involving a negative slope.",
    "47": "Write linear expressions based on an initial value and one additional point.",
    "48": "Write linear expressions based on an initial value and a rate of change.",
    "49": "Write linear expressions based on two given points.",
    "50": "Handle negative constants in standard form equations.",
    "51": "Input the x-intercept to represent one solution of a linear equation.",
    "52": "Input the y-intercept to represent one solution of a linear equation.",
    "53": "Accurately place coordinate points on a graph to represent data or solutions.",
    "54": "Exclude the line when shading regions of a graph for inequalities.",
    "55": "Shade regions for SIF equations with positive slopes.",
    "56": "Shade regions for equations representing greater-than relationships.",
    "57": "Handle positive constants in standard form equations.",
    "58": "Include the line when shading regions of a graph for inequalities.",
    "59": "Shade regions for SIF equations with negative slopes.",
    "60": "Shade regions for equations representing less-than relationships.",
    "61": "Handle negative constants in GLF form equations.",
    "62": "Input the x-intercept for a GLF equation.",
    "63": "Input the y-intercept for a GLF equation.",
    "64": "Input the slope value for a GLF equation.",
    "65": "Input a given point for a GLF equation.",
    "66": "Shade regions for GLF equations with positive slopes.",
    "67": "Shade regions for GLF equations with negative slopes.",
    "68": "Handle positive constants in GLF form equations.",
    "69": "Write quadratic expressions to model nonlinear relationships.",
    "70": "Input computed linear values into the equation.",
    "71": "Input given linear values into the equation.",
    "72": "Input computed quadratic values into the equation.",
    "73": "Input given quadratic values into the equation.",
    "74": "Correctly place points on a graph to reflect equations or data.",
    "75": "Factor quadratic expressions to identify roots or simplify calculations.",
    "76": "Simplify quadratic expressions using specific numerical approaches (Type 1).",
    "77": "Simplify quadratic expressions using specific numerical approaches (Type 2).",
    "78": "Simplify quadratic expressions by clearing the denominator.",
    "79": "Apply exponent rules to expand and simplify expressions with powers or radicals.",
    "80": "Eliminate parentheses by selecting and applying appropriate distribution rules.",
    "81": "Perform standard multiplication to simplify expressions.",
    "82": "Handle multiplication for secondary or nested terms in an expression.",
    "83": "Write ratio-based expressions to represent relationships between quantities.",
    "84": "Convert units into mixed forms to align with problem requirements.",
    "85": "Input the y-intercept to define the equation of a line.",
    "86": "Input the slope to define the equation of a line.",
    "87": "Set the y-intercept to adjust a linear expression.",
    "88": "Set the slope to adjust a linear expression.",
    "89": "Select and simplify nested multiplication or division operations.",
    "90": "Combine whole terms to simplify and rearrange expressions.",
    "91": "Perform complete multiplication operations to simplify expressions.",
    "92": "Select and execute multiplication rules to adjust equations.",
    "93": "Perform refined multiplication rules to simplify expressions.",
    "94": "Remove negative coefficients by making variables positive.",
    "95": "Determine whether an equation has no solution and identify the reasons.",
    "96": "Combine simplified terms to adjust and refine expressions.",
    "97": "Identify the parent description of an equation or function.",
    "98": "Identify the parent equation and extract its primary characteristics.",
    "99": "Identify the parent curve and understand its key features.",
    "100": "Select the value of k on a graph to modify the function.",
    "101": "Edit the algebraic value of k to adjust the function.",
    "102": "Select the vertical reflection value on a graph.",
    "103": "Edit the vertical reflection value in the algebraic equation.",
    "104": "Select the value of a on a graph to modify the function.",
    "105": "Edit the algebraic value of a to adjust the function.",
    "106": "Edit the algebraic value of h to adjust the function.",
    "107": "Select the value of h on a graph to modify the function.",
    "108": "Input the slope to define a SIF equation.",
    "109": "Make variables positive by adding or shifting terms.",
    "110": "Select and execute nested multiplication rules for whole expressions.",
    "111": "Determine if an equation has infinite solutions and describe their characteristics."
}
