{
    "0": "Recognize the larger quantity in a multiplication scenario.",
    "1": "Draw a bar to represent the larger quantity in multiplication.",
    "2": "Draw a bar to represent the smaller quantity in multiplication.",
    "3": "Input the smaller initial value in a diagram based on given information.",
    "4": "Input the larger initial value in a diagram based on calculations.",
    "5": "Input the total value in a diagram calculated from multiplication.",
    "6": "Extract and input a quantity from a diagram by interpreting its elements.",
    "7": "Recognize the larger quantity in an addition scenario.",
    "8": "Draw a bar to represent the smaller quantity in addition or subtraction.",
    "9": "Draw a bar to represent the larger quantity in addition or subtraction.",
    "10": "Copy the initial value into a diagram without modification.",
    "11": "Input the added quantity in a diagram for clarity.",
    "12": "Input the initial value in a diagram based on provided information.",
    "13": "Input the total value in a diagram calculated from addition.",
    "14": "Determine and input a value in a diagram based on calculations.",
    "15": "Recognize the larger quantity in a subtraction scenario.",
    "16": "Input the smaller initial value in a diagram based on calculations.",
    "17": "Input the subtracted quantity in a diagram to represent the change.",
    "18": "Input the larger initial value in a diagram based on provided data.",
    "19": "Input the total value in a diagram calculated from subtraction.",
    "20": "Calculate the product of two numbers using multiplication.",
    "21": "List consecutive multiples of a given number systematically.",
    "22": "Identify a number as a common multiple of two or more numbers.",
    "23": "Recognize the least common multiple (LCM) as the product of numbers.",
    "24": "Identify the least common multiple when one number is a multiple of the other.",
    "25": "Determine the least common multiple (LCM) of two or more numbers.",
    "26": "Determine the greatest common factor (GCF) of two or more numbers.",
    "27": "Identify a number as a common factor of two or more numbers.",
    "28": "List all factors of a large number systematically.",
    "29": "Recognize the GCF when one number is a multiple of the other.",
    "30": "Determine the number of items in each group based on the GCF.",
    "31": "Identify the number of equal divisions in a vertical bar model.",
    "32": "Associate a fraction with each piece of a vertical bar.",
    "33": "Count the shaded parts in a vertical bar when they are discontiguous.",
    "34": "Identify a fraction using a fraction shape diagram.",
    "35": "Determine the number of equal divisions in a square.",
    "36": "Associate a fraction with each piece of a square model.",
    "37": "Count the shaded parts in a square when they are contiguous.",
    "38": "Determine the number of equal divisions in a circular model.",
    "39": "Associate a fraction with each piece of a circular model.",
    "40": "Count the shaded parts in a circle when they are contiguous.",
    "41": "Count the shaded parts in a vertical bar when they are contiguous.",
    "42": "Determine the number of equal divisions in a horizontal bar model.",
    "43": "Associate a fraction with each piece of a horizontal bar.",
    "44": "Count the shaded parts in a horizontal bar when they are discontiguous.",
    "45": "Count the shaded parts in a horizontal bar when they are contiguous.",
    "46": "Count the shaded parts in a circle when they are discontiguous.",
    "47": "Count the shaded parts in a square when they are discontiguous.",
    "48": "Determine the number of desired items in a scenario.",
    "49": "Determine the total number of items in a scenario.",
    "50": "Identify the fraction representing the desired items.",
    "51": "Determine the number of equal groups represented by a fraction.",
    "52": "Identify the number of desired groups by constructing the fraction.",
    "53": "Count the total number of items in a given setup.",
    "54": "Determine the number of recipients in a division scenario.",
    "55": "Select a proper fraction from a given option.",
    "56": "Identify a proper fraction from a second option.",
    "57": "Compare two options using mathematical operations.",
    "58": "Simplify and compare two mathematical options.",
    "59": "Select an improper fraction from a given option.",
    "60": "Identify an improper fraction from a second option.",
    "61": "Determine the number of desired groups in a scenario.",
    "62": "Count the number of items in each group in a setup.",
    "63": "Calculate a specific part of a given quantity.",
    "64": "Input the numerator of a group in a fractional setup.",
    "65": "Input the denominator of a group in a fractional setup.",
    "66": "Input the numerator of items in a fractional setup.",
    "67": "Input the denominator of items in a fractional setup.",
    "68": "Calculate the total amount in a scenario.",
    "69": "Identify the multiplier in a written question using a rectangle.",
    "70": "Identify the multiplier in an equivalence statement.",
    "71": "Label an equivalent fraction in an equivalence statement.",
    "72": "Label an equivalent fraction in a visual model.",
    "73": "Determine the number of equal divisions on a number line based on the desired denominator.",
    "74": "Label the equivalent fraction on a number line.",
    "75": "Identify the multiplier in a written question using a number line.",
    "76": "Identify the greatest common factor (GCF) in a written question.",
    "77": "Identify the GCF in an equivalence statement.",
    "78": "Identify the common denominator of two or more fractions.",
    "79": "Rewrite a fraction with a common denominator.",
    "80": "Compare fractions with the same denominators.",
    "81": "Compare fractions with different denominators.",
    "82": "Compare fractions in the context of a problem.",
    "83": "Calculate the sum of two fractions in a non-contextual setup.",
    "84": "Identify that a fraction is already in its simplest form.",
    "85": "Calculate the difference between two fractions in a contextual problem.",
    "86": "Calculate the sum of two fractions in a contextual scenario.",
    "87": "Determine whether a fraction can be simplified further.",
    "88": "Calculate the difference between two fractions in a non-contextual problem.",
    "89": "Represent the first fraction on a number line.",
    "90": "Represent the second fraction as a sum on a number line.",
    "91": "Represent the second fraction as a difference on a number line.",
    "92": "Identify the lower bound of a whole number.",
    "93": "Identify the upper bound of a whole number.",
    "94": "Determine the number of equal divisions in a visual fraction representation.",
    "95": "Identify the whole number part of a mixed number symbolically.",
    "96": "Identify the fractional part of a mixed number symbolically.",
    "97": "Convert a whole number to an improper fraction.",
    "98": "Extract the numerator of the fractional part of a mixed number.",
    "99": "Rewrite a mixed number as an improper fraction.",
    "100": "Determine the whole number part of an improper fraction symbolically.",
    "101": "Determine the fractional part of an improper fraction symbolically.",
    "102": "Convert an improper fraction into a whole number.",
    "103": "Rewrite an improper fraction as a mixed number.",
    "104": "Determine the equal parts for a multiplicand in a multiplication setup.",
    "105": "Determine the equal parts for a multiplier in a multiplication setup.",
    "106": "Represent the multiplier visually in a diagram.",
    "107": "Represent the multiplicand visually in a diagram.",
    "108": "Identify the length of overlap in a multiplication area model.",
    "109": "Identify the width of overlap in a multiplication area model.",
    "110": "Calculate the area of overlap in a multiplication area model.",
    "111": "Calculate a product using a multiplication statement.",
    "112": "Determine whether a fraction can or cannot be simplified.",
    "113": "Calculate a product using an 'of' statement to represent multiplication.",
    "114": "Simplify a fraction to its lowest terms.",
    "115": "Select terms for addition or subtraction based on like denominators.",
    "116": "Simplify a fraction by reducing it to its simplest form.",
    "117": "Select and regroup a mixed number for calculation.",
    "118": "Simplify a fraction using input tools to guide the reduction process.",
    "119": "Rewrite fractions with a common denominator to enable operations.",
    "120": "Rewrite a mixed number as an improper fraction for further operations.",
    "121": "Rewrite an improper fraction as a mixed number for interpretation.",
    "122": "Perform rewriting of mixed numbers as improper fractions using input tools.",
    "123": "Perform rewriting of fractions with a common denominator using input tools.",
    "124": "Perform addition or subtraction by selecting terms with matching properties.",
    "125": "Apply the rule of inverting the divisor and multiplying to simplify division of fractions.",
    "126": "Perform inversion and multiplication using input tools for division of fractions.",
    "127": "Select and multiply through an expression to simplify it.",
    "128": "Perform multiplication through an expression using input-based tools.",
    "129": "Enter a general digit related to money values (not tracked for analytics).",
    "130": "Enter a general money label (not tracked for analytics).",
    "131": "Enter a general digit for calculations (not tracked for analytics).",
    "132": "Enter a general label for calculations (not tracked for analytics).",
    "133": "Input the decimal equivalent of a given word form.",
    "134": "Calculate the sum of the whole number parts of a mixed number or equation.",
    "135": "Perform multiplication for components of an expanded form representation.",
    "136": "Determine the least common denominator (LCD) of two or more fractions.",
    "137": "Rewrite a fraction using the least common denominator.",
    "138": "Calculate the sum of the fractional parts of a number or equation.",
    "139": "Express a decimal number as a fraction.",
    "140": "Write a fraction in its simplest form through reduction.",
    "141": "Identify the appropriate mathematical operator for a given scenario.",
    "142": "Input the answer as a digit (not tracked for analytics).",
    "143": "Place the decimal point correctly in a sum or difference.",
    "144": "Approximate the product of numbers expressed as percentages.",
    "145": "Place the decimal point correctly in a product.",
    "146": "Calculate a partial product and carry out necessary steps.",
    "147": "Calculate a partial product with carrying in and out.",
    "148": "Calculate a partial product with carrying into the next place value.",
    "149": "Calculate a partial product with no carrying involved.",
    "150": "Calculate the product of numbers in a contextual problem.",
    "151": "Approximate a product by determining its order of magnitude.",
    "152": "Approximate a quotient by estimating its order of magnitude.",
    "153": "Position the dividend correctly in a division setup.",
    "154": "Position the divisor correctly in a division setup.",
    "155": "Place the decimal point correctly in a quotient.",
    "156": "Calculate the digit of a quotient when it is non-zero.",
    "157": "Calculate the internal product during a division process.",
    "158": "Calculate the internal difference during a division process.",
    "159": "Bring down the next digit of the dividend during long division.",
    "160": "Calculate the quotient in a contextual division problem.",
    "161": "Approximate the quotient as a percentage.",
    "162": "Calculate the digit of a quotient when it is zero.",
    "163": "Add trailing zeroes to a quotient when necessary for accuracy.",
    "164": "Place the decimal point in the divisor during a division setup.",
    "165": "Place the decimal point in the dividend during a division setup.",
    "166": "Input the label for the denominator in a ratio.",
    "167": "Input the given denominator value of a ratio.",
    "168": "Input the given numerator value of a ratio.",
    "169": "Input the label for the numerator in a ratio.",
    "170": "Input the quantity to the left of the colon in a ratio.",
    "171": "Input the label to the left of the colon in a ratio.",
    "172": "Input the quantity to the right of the colon in a ratio.",
    "173": "Input the label to the right of the colon in a ratio.",
    "174": "Write a ratio using a colon to separate terms.",
    "175": "Calculate the numerator of a ratio from given values.",
    "176": "Input the ratio quantity to the left of 'to'.",
    "177": "Input the ratio label to the left of 'to'.",
    "178": "Input the ratio quantity to the right of 'to'.",
    "179": "Input the ratio label to the right of 'to'.",
    "180": "Calculate the denominator of a ratio from given values.",
    "181": "Enter the label in the numerator for a rate problem.",
    "182": "Enter the label in the denominator for a rate problem.",
    "183": "Input the numerator value for a given rate.",
    "184": "Input the denominator value for a given rate.",
    "185": "Calculate the unit rate by dividing the given quantities.",
    "186": "Input the rate label to the left of 'per'.",
    "187": "Input the rate label to the right of 'per'.",
    "188": "Compare unit rates to determine relative values.",
    "189": "Enter the numerator of a given rate in a proportion.",
    "190": "Enter the label for the numerator in a proportion.",
    "191": "Enter the denominator of a given rate in a proportion.",
    "192": "Enter the label for the denominator in a proportion.",
    "193": "Input the total value in a proportion.",
    "194": "Input the part value in a proportion with a variable.",
    "195": "Select the operator in a fractional identity equation.",
    "196": "Input the numerator for a form of 1 in a fraction.",
    "197": "Input the denominator for a form of 1 in a fraction.",
    "198": "Calculate the part value in a proportion using fractions.",
    "199": "Input the calculated value of a rate.",
    "200": "Input the total value in a proportion with a variable.",
    "201": "Enter the numerator of a given fraction in a proportion.",
    "202": "Enter the denominator of a given fraction in a proportion.",
    "203": "Calculate the total value in a proportion with fractions.",
    "204": "Input the calculated value of a ratio.",
    "205": "Input the numerator of a given unit rate in a proportion.",
    "206": "Input the denominator of a given unit rate in a proportion.",
    "207": "Input the given part value in a proportion.",
    "208": "Input the second extreme value in a proportion equation.",
    "209": "Input the first extreme value in a proportion equation.",
    "210": "Input the first mean value in a proportion equation.",
    "211": "Input the second mean value in a proportion equation.",
    "212": "Calculate the product of the means or extremes in a proportion.",
    "213": "Calculate the solution to a problem using means and extremes.",
    "214": "Calculate the percentage from a given decimal value.",
    "215": "Input a given decimal value for percentage conversion.",
    "216": "Convert a given decimal into a fraction.",
    "217": "Input a percentage value from a model.",
    "218": "Input a fraction value from a given model.",
    "219": "Input a decimal value from a given model.",
    "220": "Input the given percentage value for a calculation.",
    "221": "Convert a given percentage into a fraction.",
    "222": "Convert a given percentage into a decimal.",
    "223": "Input a given fraction for a calculation.",
    "224": "Convert a given fraction into a decimal.",
    "225": "Convert a given fraction into a percentage.",
    "226": "Convert a given decimal into an improper fraction.",
    "227": "Calculate the numerator of a mixed number from a given decimal.",
    "228": "Determine the whole number part of a mixed number from a decimal.",
    "229": "Identify whether an improper fraction can be simplified.",
    "230": "Identify whether a mixed number can be simplified.",
    "231": "Input the whole number part of a given mixed number.",
    "232": "Convert a mixed number into an improper fraction.",
    "233": "Convert a mixed number into a decimal.",
    "234": "Convert a mixed number into a percentage.",
    "235": "Input the numerator part of a given mixed number.",
    "236": "Input an improper fraction from a given model.",
    "237": "Calculate the numerator of a mixed number using a given model.",
    "238": "Calculate the whole number part of a mixed number using a given model.",
    "239": "Input a given improper fraction for calculations.",
    "240": "Calculate the numerator of a mixed number from an improper fraction.",
    "241": "Calculate the whole number part of a mixed number from an improper fraction.",
    "242": "Convert an improper fraction into a decimal.",
    "243": "Convert an improper fraction into a percentage.",
    "244": "Convert a percentage into an improper fraction.",
    "245": "Calculate the numerator of a mixed number from a percentage.",
    "246": "Determine the whole number part of a mixed number from a percentage.",
    "247": "Input a given fractional percentage for calculations.",
    "248": "Convert a fractional percentage into a decimal percentage.",
    "249": "Convert a fractional percentage into a decimal.",
    "250": "Convert a fractional percentage into a fraction.",
    "251": "Convert a fraction into a fractional percentage.",
    "252": "Convert a fraction into a decimal percentage.",
    "253": "Input a given decimal percentage for calculations.",
    "254": "Convert a decimal percentage into a fractional percentage.",
    "255": "Convert a decimal percentage into a decimal.",
    "256": "Convert a decimal percentage into a fraction.",
    "257": "Convert a decimal into a decimal percentage.",
    "258": "Convert a decimal into a fractional percentage.",
    "259": "Calculate a percentage based on a real-world context.",
    "260": "Calculate the total value in a real-world context.",
    "261": "Calculate a part of the total in a real-world context.",
    "262": "Input the numerator of a percentage within a proportion.",
    "263": "Calculate the part of a total value outside a specific context.",
    "264": "Input the numerator of a percentage variable in a proportion.",
    "265": "Calculate a percentage outside a real-world context.",
    "266": "Calculate the total outside a specific context.",
    "267": "Input the label for the final answer of a calculation.",
    "268": "Identify whether a percent change is an increase or decrease.",
    "269": "Input the numerator of percent change when it includes a variable.",
    "270": "Input the given amount of change within a proportion.",
    "271": "Input the original value in a proportion.",
    "272": "Calculate the percent change within a contextual problem.",
    "273": "Input the label for the final answer in percent change.",
    "274": "Input the calculated amount of change in a proportion.",
    "275": "Input the calculated original value in a proportion.",
    "276": "Input the given percent change within a proportion.",
    "277": "Input the amount of change with a variable in a proportion.",
    "278": "Calculate the final value after applying a percent change in context.",
    "279": "Identify a negative integer from its position on a number line.",
    "280": "Identify a positive integer from its position on a number line.",
    "281": "Represent a negative integer visually using a number line.",
    "282": "Represent a positive integer visually using a number line.",
    "283": "Plot the first integer on a number line.",
    "284": "Represent the second positive integer as a difference on a number line.",
    "285": "Calculate the difference between positive integers.",
    "286": "Represent the second positive integer as a sum on a number line.",
    "287": "Calculate the sum of positive integers.",
    "288": "Rewrite an expression involving addition of a positive integer.",
    "289": "Rewrite an expression involving addition of a negative integer.",
    "290": "Represent the second negative integer as a sum on a number line.",
    "291": "Calculate the sum of negative integers.",
    "292": "Rewrite an expression involving subtraction of a negative integer.",
    "293": "Represent the second negative integer as a difference on a number line.",
    "294": "Calculate the difference between negative integers.",
    "295": "Rewrite an expression involving subtraction of a positive integer.",
    "296": "Select and apply multiplication rules to solve an equation.",
    "297": "Perform multiplication for a second row of values in a setup.",
    "298": "Simplify fractions using a step-by-step process.",
    "299": "Determine the base of an exponential number from a whole number.",
    "300": "Identify when no further factors can be derived from a number.",
    "301": "Write the positive exponent of an exponential number derived from another value.",
    "302": "Determine the base of an exponential number from its product form.",
    "303": "Write the positive exponent of an exponential number based on its product form.",
    "304": "Express a whole number in terms of its factors.",
    "305": "Determine the whole number represented by a given exponential expression.",
    "306": "Write the base of an exponential number derived from a fraction.",
    "307": "Write the negative exponent of an exponential number derived from a value.",
    "308": "Write the base of an exponential fraction in its product form.",
    "309": "Write the negative exponent of an exponential number in its product form.",
    "310": "Express a fraction as a product of its factors.",
    "311": "Determine the fraction represented by a given exponential expression.",
    "312": "Identify the number of equal divisions on a number line.",
    "313": "Associate a fraction with each segment of a number line.",
    "314": "Determine a fraction based on its representation on a number line.",
    "315": "Recognize and define the units relevant to a problem.",
    "316": "Input a given value or piece of information into a setup.",
    "317": "Find the value of Y in any given form or equation.",
    "318": "Write an expression in any given mathematical form.",
    "319": "Select the appropriate rule to eliminate parentheses and simplify.",
    "320": "Select and apply nested multiplication or division rules.",
    "321": "Combine terms with no variables to simplify an expression.",
    "322": "Combine like terms in an expression to simplify it.",
    "323": "Perform multiplication across entire expressions to simplify.",
    "324": "Combine like terms in full expressions to simplify.",
    "325": "Find the value of X in any given form or equation.",
    "326": "Isolate the variable in positive form to solve an equation.",
    "327": "Combine variables with no coefficients to simplify an equation.",
    "328": "Isolate the variable in negative form to solve an equation.",
    "329": "Apply addition or subtraction to isolate variables or combine terms.",
    "330": "Remove a negative coefficient from a variable using algebraic transformations.",
    "331": "Remove a positive coefficient from a variable using algebraic transformations.",
    "332": "Simplify an equation using multiplication or division.",
    "333": "Perform refined multiplication operations to simplify terms.",
    "334": "Simplify equations with negative coefficients in specific contexts.",
    "335": "Combine variables with coefficients to simplify an equation.",
    "336": "Remove constants from an equation by isolating variables.",
    "337": "Evaluate whether a solution is complete or falls under specific cases like no solution or infinite solutions.",
    "338": "Label axes to clearly represent the variables in a graph.",
    "339": "Adjust the bounds of the axes to accommodate the data or graph.",
    "340": "Modify axis intervals to improve clarity or presentation.",
    "341": "Place points correctly on a graph to represent data or solutions.",
    "342": "Identify an acute angle based on its measurement.",
    "343": "Position a protractor correctly at the vertex of an angle.",
    "344": "Measure an acute angle using a protractor.",
    "345": "Identify an obtuse angle based on its measurement.",
    "346": "Measure an obtuse angle using a protractor.",
    "347": "Recognize a right angle based on its 90-degree measure.",
    "348": "Measure a right angle using a protractor.",
    "349": "Identify a straight angle based on its 180-degree measure.",
    "350": "Measure a non-horizontal straight angle accurately.",
    "351": "Measure a horizontal straight angle using proper tools.",
    "352": "Simplify equations by calculating and removing negative coefficients.",
    "353": "Apply distribution rules to eliminate parentheses and simplify expressions.",
    "354": "Simplify expressions by calculating and removing parentheses.",
    "355": "Identify angles that are supplementary based on their sum.",
    "356": "Determine the supplementary angle of a given angle.",
    "357": "Recognize alternate interior angles in a geometric setup.",
    "358": "Calculate the measure of an alternate interior angle.",
    "359": "Identify corresponding angles in a geometric diagram.",
    "360": "Find the measure of a corresponding angle in a diagram.",
    "361": "Recognize alternate exterior angles in a geometric setup.",
    "362": "Calculate the measure of an alternate exterior angle.",
    "363": "Determine the measure of a vertical angle in a diagram.",
    "364": "Identify vertical angles in a geometric setup.",
    "365": "Calculate the third angle of a triangle based on the sum of angles.",
    "366": "Perform multiplication across all terms in an expression.",
    "367": "Select and combine terms to simplify an equation or expression.",
    "368": "Rewrite an improper fraction as a mixed number using input tools.",
    "369": "Calculate the product of improper and proper fractions, ensuring simplification.",
    "370": "Regroup mixed numbers using input tools for subtraction or addition.",
    "371": "Simplify across fractions by reducing numerators and denominators.",
    "372": "Simplify fractions by reducing across both numerators and denominators using input tools.",
    "373": "Identify the value of the thousands place digit from a number.",
    "374": "Identify the tens digit based on its place value in a number.",
    "375": "Identify the tenths digit from a decimal's place value.",
    "376": "Identify the value of the ones place digit from a number.",
    "377": "Identify the hundreds digit based on its place value in a number.",
    "378": "Identify the hundredths digit from a decimal's place value.",
    "379": "Identify the value of the thousandths place digit from a number.",
    "380": "Identify the thousandths digit based on its place value in a decimal.",
    "381": "Identify the thousands digit based on its place value in a number.",
    "382": "Identify the tens place value from a specific digit.",
    "383": "Identify the hundreds place value from a specific digit.",
    "384": "Identify the tenths place value from a specific digit.",
    "385": "Identify the hundredths place value from a specific digit.",
    "386": "Input the multiplier for the ones place in an expression.",
    "387": "Convert a proper fraction to a decimal when the denominator is a power of 10, with no leading zero.",
    "388": "Convert a proper fraction to a decimal when the denominator is a power of 10, including leading zeros.",
    "389": "Convert a mixed number to a decimal when the denominator is a power of 10, without leading zeros.",
    "390": "Convert a mixed number to a decimal when the denominator is a power of 10, including leading zeros.",
    "391": "Convert a proper fraction to a decimal when the denominator is a factor of a power of 10, without leading zeros.",
    "392": "Convert a proper fraction to a decimal when the denominator is a factor of a power of 10, including leading zeros.",
    "393": "Convert a mixed number to a decimal when the denominator is a factor of a power of 10, without leading zeros.",
    "394": "Convert a mixed number to a decimal when the denominator is a factor of a power of 10, including leading zeros.",
    "395": "Add trailing zeroes to a decimal to match a required format.",
    "396": "Convert a fraction to a decimal using division.",
    "397": "Write the whole number multiplier from a given number.",
    "398": "Write the positive power of ten from a given number.",
    "399": "Write the positive exponent in scientific notation from a given number.",
    "400": "Write the whole number multiplier in scientific notation.",
    "401": "Extract the whole number multiplier from a given scientific notation.",
    "402": "Extract the positive power of ten from a given scientific notation.",
    "403": "Write the number represented by a positive exponent.",
    "404": "Write the decimal multiplier from a given scientific notation.",
    "405": "Extract the decimal multiplier from a given number.",
    "406": "Write the decimal multiplier as part of scientific notation.",
    "407": "Write the negative power of ten from a given number.",
    "408": "Write the negative exponent in scientific notation from a given number.",
    "409": "Extract the negative power of ten from a given scientific notation.",
    "410": "Write the number represented by a negative exponent.",
    "411": "Input the smaller initial value in a diagram based on calculations.",
    "412": "Input the total value in a diagram based on provided data.",
    "413": "Input the initial value in a diagram based on calculations.",
    "414": "Input the larger initial value in a diagram based on calculations.",
    "415": "Input a variable into a diagram for problem representation.",
    "416": "Input a variable expression in a diagram for multiplication.",
    "417": "Define a variable to represent an unknown in a problem.",
    "418": "Define a variable expression to represent a relationship or equation.",
    "419": "Add variable expressions to simplify or solve equations.",
    "420": "Solve multiplication problems by applying the appropriate rules.",
    "421": "Represent a fraction visually using a number line.",
    "422": "Calculate the difference between two proper fractions and simplify.",
    "423": "Input the multiplier for the thousandths place as a decimal.",
    "424": "Input the multiplier for the tenths place as a decimal.",
    "425": "Input the multiplier for the hundredths place as a decimal.",
    "426": "Input the multiplier for the tenths place as a fraction.",
    "427": "Input the multiplier for the hundredths place as a fraction.",
    "428": "Input the multiplier for the thousandths place as a fraction.",
    "429": "Input the multiplier for the tens place in an expression.",
    "430": "Calculate the sum of an improper and a proper fraction, ensuring simplification.",
    "431": "Select and regroup polynomials for subtraction operations.",
    "432": "Solve addition problems by applying standard rules.",
    "433": "Input a variable expression in a diagram for subtraction.",
    "434": "Solve subtraction problems by applying standard rules.",
    "435": "Calculate the quotient of two proper fractions and simplify.",
    "436": "Calculate the difference between two mixed numbers and simplify.",
    "437": "Simplify equations by making variables positive through transformations.",
    "438": "Consolidate variables on either side of an equation to simplify it.",
    "439": "Combine terms, including constants and variables, in full expressions.",
    "440": "Set the y-intercept value to adjust a graph or equation.",
    "441": "Input the y-intercept value for a linear equation.",
    "442": "Input the slope value for a linear equation.",
    "443": "Set the slope value to modify a graph or linear equation.",
    "444": "Input the number of desired outcomes from a visual representation.",
    "445": "Input the total number of outcomes from a visual representation.",
    "446": "Input the fractional probability of an event.",
    "447": "Input the decimal probability of an event.",
    "448": "Input the percent probability of an event.",
    "449": "Input the number of desired outcomes based on a verbal description.",
    "450": "Input the total number of outcomes based on a verbal description.",
    "451": "Input the theoretical probability of an event.",
    "452": "Input the experimental probability for a small sample size.",
    "453": "Input the experimental probability for a medium sample size.",
    "454": "Input the experimental probability for a large sample size.",
    "455": "Compare probabilities from different trials to assess variations.",
    "456": "Compare probabilities from the same trials for consistency.",
    "457": "Select the first event in a probability setup.",
    "458": "Select the second event in a probability setup.",
    "459": "Determine whether two events are dependent or independent.",
    "460": "Input the number of outcomes for event 1 in a probability tool.",
    "461": "Input the number of outcomes for event 2 in a probability tool.",
    "462": "Input the number of outcomes for event 1 in a probability table.",
    "463": "Input the number of outcomes for event 2 in a probability table.",
    "464": "Input the total number of outcomes in a probability table.",
    "465": "Input the sum of all entries in a table or setup.",
    "466": "Input the number of entries in a data set or table.",
    "467": "Input the mean value of a data set.",
    "468": "Input the range of a data set (difference between highest and lowest values).",
    "469": "Calculate the median for a data set with an odd number of entries.",
    "470": "Determine the number of modes in a data set.",
    "471": "Calculate the median for a data set with an even number of entries.",
    "472": "Determine the single mode in a data set, if applicable.",
    "473": "Select the mean value from a given data set.",
    "474": "Select the mode value from a given data set.",
    "475": "Select the median value from a given data set.",
    "476": "Input the original median value of a data set before changes.",
    "477": "Input the original mean value of a data set before changes.",
    "478": "Input the new mean value after changes to a data set.",
    "479": "Input the new median value after changes to a data set.",
    "480": "Compare the means before and after adding internal data points.",
    "481": "Compare a data point with the original mean after adding internal points.",
    "482": "Compare the medians before and after adding internal data points.",
    "483": "Compare differences in data before and after adding internal points.",
    "484": "Compare the means before and after adding an outlier.",
    "485": "Compare a data point with the original mean after adding an outlier.",
    "486": "Compare the medians before and after adding an outlier.",
    "487": "Compare differences in data before and after adding an outlier.",
    "488": "Compare the means before and after removing an outlier.",
    "489": "Compare a data point with the original mean after removing an outlier.",
    "490": "Compare the medians before and after removing an outlier.",
    "491": "Compare differences in data before and after removing an outlier.",
    "492": "Simplify equations with variables in the denominator, reorganizing as needed."
}
